tongkong1/MCU-CDK66/MK66F18_Ref9b.c
PID_Parameter speed_Parameter =     //速度闭环控制  //TODO:电机驱动是否更适合增量式PID？
{
    .integral = 0,   //初始化，勿改动
    .lastError = 0,  //初始化，勿改动
	.error = 0,		//初始化，勿改动
    .kp = 0.75,
    .ki = 0,
    .kd = 2.5,
    .proportionMax = 60,
    .integralMax = 60,
    .derivativeMax = 60,
    .outputMax = 60
};
PID_Parameter angle_Parameter =     //速度闭环控制  //TODO:电机驱动是否更适合增量式PID？
{
    .integral = 0,   //初始化，勿改动
    .lastError = 0,  //初始化，勿改动
	.error = 0,		//初始化，勿改动
    .kp = 7.5,
    .ki = 0,
    .kd = 40,
    .proportionMax = 2500,
    .integralMax = 0,
    .derivativeMax = 2500,
    .outputMax = 2500
};
PID_Parameter* motor_PIDInfo = &speed_Parameter;
PID_Parameter* servo_PIDInfo = &angle_Parameter;


// Variables for Debug
uint8_t Second_Cnt = 0;	//秒计时器，用于调试
uint8_t Button_Cnt = 0;	//按键按下数，用于制作参数调整
uint8_t PIT_20ms_status = 0;	//20ms状态，用于蜂鸣器鸣叫
uint8_t PIT_500ms_status = 0;	//100ms状态
uint8_t PIT_500ms_counter = 0;  //20ms*5=100ms，用于断续线元素定时保护
uint8_t BEEP_inteval_counter = 15;	//20ms*15=300ms


void DMA_CAM_Repeat(uint8_t LineNumber)
{
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].DADDR         = (uint32_t) &Image_Data[LineNumber][0];
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].CITER_ELINKNO = DMA_CITER_ELINKNO_CITER(188);
	DMA_DMA_BASEADDR->TCD[DMA_CH0_DMA_CHANNEL].BITER_ELINKNO = DMA_BITER_ELINKNO_BITER(188);
	//EDMA_EnableChannelRequest(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
	DMA_DMA_BASEADDR->SERQ = DMA_SERQ_SERQ(DMA_CH0_DMA_CHANNEL);
}

/* DMA0_DMA16_IRQn interrupt handler */
void DMA_DMA_CH_INT_DONE_0_IRQHANDLER(void) {
  uint32_t CH0_status;

  /* Reading all flags of status register */
  CH0_status = EDMA_GetChannelStatusFlags(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
  /* Clearing all flags of the channel status register */
  EDMA_ClearChannelStatusFlags(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL, CH0_status);

  /* Place your code here */
  //CamDataReady = 1;
  //DMA_CAM_Repeat();

  /*
  CAM_DMA_Counter++;
  if ((CAM_DMA_Counter%50)==0)
	  LED2_TOGGLE();
	*/

  /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F
     Store immediate overlapping exception return operation might vector to incorrect interrupt. */
  #if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
  #endif
}

float PIDCalc(float target, PID_Parameter* PIDInfo)
{
    float componentKp, componentKi, componentKd;
    PIDInfo->error = target - PIDInfo->input;

    PIDInfo->integral += PIDInfo->error;
    PIDInfo->derivative = PIDInfo->error - PIDInfo->lastError;
    //限值，注意单独限制integral
    if(PIDInfo->ki != 0)    //防止除数为0
        PIDInfo->integral = clip(PIDInfo->integral, -PIDInfo->integralMax/PIDInfo->ki, PIDInfo->integralMax/PIDInfo->ki);
    componentKi = PIDInfo->integral * PIDInfo->ki;

    componentKp = clip(PIDInfo->error * PIDInfo->kp, -PIDInfo->proportionMax, PIDInfo->proportionMax);
    componentKd = clip(PIDInfo->derivative * PIDInfo->kd, -PIDInfo->derivativeMax, PIDInfo->derivativeMax);

    PIDInfo->output = clip(componentKp + componentKi + componentKd, -PIDInfo->outputMax, PIDInfo->outputMax);
    // PIDInfo->output = clip(componentKp + componentKi + componentKd, 0, PIDInfo->outputMax);

    PIDInfo->lastError =  PIDInfo->error;  //更新误差

    return PIDInfo->output;
}

void ShowNumHEX(uint8_t num) {
	uint16_t l;
	l = DSPTable[num & 0x0F];

	// DSP: PD9~PD15
	GPIO_PortSet(BOARD_INITPINS_SEG_A_GPIO, 0x7F << BOARD_INITPINS_SEG_A_PIN);	// turn off all DSP segments
	GPIO_PortClear(BOARD_INITPINS_SEG_A_GPIO, ((~l)&0x7F) << BOARD_INITPINS_SEG_A_PIN);	// turn on the code segments
}

void ShowNumDEC(uint8_t num) {
	uint16_t l;
	l = DSPTable[num % 10];

	// DSP: PD9~PD15
	GPIO_PortSet(BOARD_INITPINS_SEG_A_GPIO, 0x7F << BOARD_INITPINS_SEG_A_PIN);	// turn off all DSP segments
	GPIO_PortClear(BOARD_INITPINS_SEG_A_GPIO, ((~l)&0x7F) << BOARD_INITPINS_SEG_A_PIN);	// turn on the code segments
}

void ShowNumOFF(void) {
	// DSP: PD9~PD15
	GPIO_PortSet(BOARD_INITPINS_SEG_A_GPIO, 0x7F << BOARD_INITPINS_SEG_A_PIN);	// turn off all DSP segments
}

/* PORTB_IRQn interrupt handler */
void GPIOB_IRQHANDLER(void) {
  /* Get pin flags */
  uint32_t pin_flags = GPIO_PortGetInterruptFlags(GPIOB);

  /* Place your interrupt code here */
  // Rotary Encoder Switch
  if (pin_flags & BOARD_INITPINS_QEPA_GPIO_PIN_MASK)
  {
	  delay();
  	  GPIO_PortClearInterruptFlags(GPIOB, BOARD_INITPINS_QEPA_GPIO_PIN_MASK);
	  if (!GPIO_PinRead(BOARD_INITPINS_QEPB_GPIO, BOARD_INITPINS_QEPB_PIN))
	  {
		  QESVar++;
	  }
	  else
	  {
		  if (QESVar>0) QESVar--;
	  }
  }
  // HREF on PTB11
  if (pin_flags & BOARD_INITPINS_CAMHREF_GPIO_PIN_MASK)
  {
	  GPIO_PortClearInterruptFlags(GPIOB, BOARD_INITPINS_CAMHREF_GPIO_PIN_MASK);
	  // Start DMA transfer on new line
	  DMA_CAM_Repeat(CamLineCounter);
	  CamLineCounter++;
	  if (CamLineCounter >= 120)
	  {
		  CamLineCounter = 0;
	  }
	  return;
  }
  // VSYN on PTB16
  if (pin_flags & BOARD_INITPINS_CAMVSYN_GPIO_PIN_MASK)
  {
	  GPIO_PortClearInterruptFlags(GPIOB, BOARD_INITPINS_CAMVSYN_GPIO_PIN_MASK);
	  //CAM_DMA_Counter = EDMA_GetRemainingMajorLoopCount(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
	  //DMA_CAM_Repeat();
	  //DMALeftSize = EDMA_GetRemainingMajorLoopCount(DMA_DMA_BASEADDR, DMA_CH0_DMA_CHANNEL);
	  CamDataReady = 1;
	  CamLineCounter = 0;
	  //DMA_CAM_Repeat();
	  CAM_DMA_Counter++;
	  if ((CAM_DMA_Counter%50)==0)
		  LED2_TOGGLE();
	  return;
  }

  /* Clear pin flags */
  GPIO_PortClearInterruptFlags(GPIOB, pin_flags);

  /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F
     Store immediate overlapping exception return operation might vector to incorrect interrupt. */
  #if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
  #endif
}

/* PC command string parsing for RTC synchronizing */
void PcCmdProcess(void) {
    int year;	/*!< Range from 1970 to 2099.*/
    int month;	/*!< Range from 1 to 12.*/
    int day;	/*!< Range from 1 to 31 (depending on month).*/
    int hour;	/*!< Range from 0 to 23.*/
    int minute;	/*!< Range from 0 to 59.*/
    int second;	/*!< Range from 0 to 59.*/
    rtc_datetime_t PCTIME;


	if (CmdDataLen == 27U)	// "#cmd01data20230405-180000\r\n"
	{
		PRINTF("Command from PC received!\r\n");
		sscanf(CmdDataBuffer, "#cmd01data%4d%2d%2d-%2d%2d%2d",
				&year, &month, &day, &hour, &minute, &second);
		PRINTF("RTC: %04hd-%02hd-%02hd %02hd:%02hd:%02hd\r\n",
				year, month, day, hour, minute, second);

	    /* Set DATE TIME registers and start RTC */
		PCTIME.year   = year;
		PCTIME.month  = month;
		PCTIME.day    = day;
		PCTIME.hour   = hour;
		PCTIME.minute = minute;
		PCTIME.second = second;
	    RTC_StopTimer(RTC);
	    RTC_SetDatetime(RTC, &PCTIME);
	    RTC_StartTimer(RTC);
	}
	else
	{
		PRINTF("Invalid RTC synchronizing command!\r\n");
	}
}

/* UART0_RX_TX_IRQn interrupt handler */
void UART0_SERIAL_RX_TX_IRQHANDLER(void) {
	uint8_t data;
	uint32_t intStatus;

