tongkong1/MCU-CDK66/MK66F18_Ref9b.c
    // ADC1
    // MEMSz: ADC1, se19
    ADC16_SetChannelConfig(ADC1_PERIPHERAL, ADC1_CH0_CONTROL_GROUP, &ADC1_channelsConfig[0]);
    while (0U == (kADC16_ChannelConversionDoneFlag &
                  ADC16_GetChannelStatusFlags(ADC1_PERIPHERAL, ADC1_CH0_CONTROL_GROUP))) {}
    AnalogInput->z = ADC16_GetChannelConversionValue(ADC1_PERIPHERAL, ADC1_CH0_CONTROL_GROUP) & 0xFFF;
    // IRV1: ADC1, se18
    ADC16_SetChannelConfig(ADC1_PERIPHERAL, ADC1_CH1_CONTROL_GROUP, &ADC1_channelsConfig[1]);
    while (0U == (kADC16_ChannelConversionDoneFlag &
                  ADC16_GetChannelStatusFlags(ADC1_PERIPHERAL, ADC1_CH1_CONTROL_GROUP))) {}
    AnalogInput->IRV1 = ADC16_GetChannelConversionValue(ADC1_PERIPHERAL, ADC1_CH1_CONTROL_GROUP) & 0xFFF;
    // HALL1: ADC1, se23
    ADC16_SetChannelConfig(ADC1_PERIPHERAL, ADC1_CH2_CONTROL_GROUP, &ADC1_channelsConfig[2]);
    while (0U == (kADC16_ChannelConversionDoneFlag &
                  ADC16_GetChannelStatusFlags(ADC1_PERIPHERAL, ADC1_CH2_CONTROL_GROUP))) {}
    AnalogInput->HALL1 = ADC16_GetChannelConversionValue(ADC1_PERIPHERAL, ADC1_CH2_CONTROL_GROUP) & 0xFFF;
    // Temperature: ADC1, se26
    ADC16_SetChannelConfig(ADC1_PERIPHERAL, ADC1_CH3_CONTROL_GROUP, &ADC1_channelsConfig[3]);
    while (0U == (kADC16_ChannelConversionDoneFlag &
                  ADC16_GetChannelStatusFlags(ADC1_PERIPHERAL, ADC1_CH3_CONTROL_GROUP))) {}
    AnalogInput->Temp = ADC16_GetChannelConversionValue(ADC1_PERIPHERAL, ADC1_CH3_CONTROL_GROUP) & 0xFFF;

    return;
}

/* PIT0_IRQn interrupt handler */
void PIT_CHANNEL_0_IRQHANDLER(void) {
  uint32_t intStatus;
  /* Reading all interrupt flags of status register */
  intStatus = PIT_GetStatusFlags(PIT_PERIPHERAL, PIT_CHANNEL_0);
  PIT_ClearStatusFlags(PIT_PERIPHERAL, PIT_CHANNEL_0, intStatus);

  /* Place your code here */
  FTM_SetSoftwareTrigger(FTM3_PERIPHERAL, true);
  //servo_update_flag = true;

  if( PIT_20ms_status == 0 )
  {
		PIT_20ms_status = 1;
  }
  else 	PIT_20ms_status = 0;

  if( PIT_500ms_counter == 25 )
  {
		PIT_500ms_status = 1;
  }
  else
  {
		PIT_500ms_status = 0;
		PIT_500ms_counter++;
  }

  /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F
     Store immediate overlapping exception return operation might vector to incorrect interrupt. */
  #if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
  #endif
}

// open-loop speed control
void MotorCtrlOL(uint8_t SpeedCmd)
{
	if(SpeedCmd > 60)	//速度限制
		SpeedCmd = 60;
	if(SpeedCmd < 0)
		SpeedCmd = 0;

	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);
}

// Closed-loop speed control
// feedback available on MotorSpeedFdbk1
void MotorCtrlCL(void)
{
	uint16_t CtrlValue=0;

	CtrlValue = MotorSpeedCal/10;		// MotorSpeedCal updated in PIT IRQ at an interval of 5ms
	if (CtrlValue > 60)					//限制CtrlValue,即限制最大速度
		CtrlValue = 60;

	//FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, CtrlValue);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);

}

// appTicks increasing at an interval of 5ms
void PIT_CHANNEL_1_IRQHANDLER(void)
{
	uint32_t intStatus;
	/* Reading all interrupt flags of status register */
	intStatus = PIT_GetStatusFlags(PIT_PERIPHERAL, PIT_CHANNEL_1);
	PIT_ClearStatusFlags(PIT_PERIPHERAL, PIT_CHANNEL_1, intStatus);

	/* Place your code here */
    /* Read Encoder#1 pulses value */
    MotorSpeedFdbk1 = FTM_GetQuadDecoderCounterValue(FTM1_PERIPHERAL);		//获得编码器feedback
    /* Clear Encoder#1 pulses counter */
    FTM_ClearQuadDecoderCounterValue(FTM1_PERIPHERAL);		//清除编码器脉冲数寄存器
    /* Read Motor#1 running direction */
    if (FTM_GetQuadDecoderFlags(FTM1_PERIPHERAL) & kFTM_QuadDecoderCountingIncreaseFlag)	//根据编码器方向确定电机运动方向【不确定底层如何实现】
    {
        MotorDir1 = 1;		//【TODO:测试这个是正转还是反转】
    }
    else if (MotorSpeedFdbk1 != 0)		//如果是反转且保证不是静止状态
    {
        MotorDir1 = 0;
        MotorSpeedFdbk1 = 5000 - MotorSpeedFdbk1;		//编码器反馈量取反
    }
    motor_PIDInfo->input = MotorSpeedFdbk1;
  	MotorCtrlOL( (uint8_t)PIDCalc( MotorSpeedTarget, motor_PIDInfo ) );		//5ms更新电机数值

  		//老师原本的闭环控制
	//用MotorSpeedFdbk1/20作为反馈，更新MotorSpeedCal
    /*if (MotorSpeedFdbk1 < MotorSpeedCmd1*20)		//实际速度小于设定速度
    {
    	MotorSpeedCal++;
    }
    else						//实际速度大于或等于预期速度
    {
    	if (MotorSpeedCal>0)	//保证MotorSpeedCal>0
    		MotorSpeedCal--;
    }*/


    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F
       Store immediate overlapping exception return operation might vector to incorrect interrupt. */
    #if defined __CORTEX_M && (__CORTEX_M == 4U)
      __DSB();
    #endif
}

/*ServoMotor controller*/
void static inline Update_ServoUS(uint8_t ChanNo, uint32_t DutyCycleUS)
{
	uint32_t cv, mod;

	if (DutyCycleUS > ServoLimitUpper)
		DutyCycleUS = ServoLimitUpper;
	if (DutyCycleUS < ServoLimitLower)
		DutyCycleUS = ServoLimitLower;
	//if ((ChanNo<2) && (DutyCycleUS<=2500) && (DutyCycleUS>=500))
	if (ChanNo < 2)
	{
		mod = FTM3_PERIPHERAL->MOD;
		cv = (mod*DutyCycleUS) / 20000U;
		if (cv >= mod)
		{
			cv = mod + 1U;
		}
		FTM3_PERIPHERAL->CONTROLS[ChanNo].CnV = cv;
		//FTM_SetSoftwareTrigger(FTM3_PERIPHERAL, true);
	}
	return;
}

// Count value calibrated with 1 second timing to be 142
void delay1ms(uint16_t delayTime) {
	uint32_t delayCount;
	delayCount = delayTime * USEC_TO_COUNT(142, CLOCK_GetFreq(SYS_CLK));
	//delayCount = delayTime * USEC_TO_COUNT(100, CLOCK_GetFreq(kCLOCK_BusClk));

	while(delayCount--) {}
}

void CCD_delay()
{
	uint16_t delayCount;
	delayCount = 20;
	while(delayCount--) {}
}

void CCD_IntegratingDelay(uint16_t delayCount)
{
	if (delayCount==0) return;
	while(delayCount--) {}
}


/* Drive to and read from TSL1401CL */
void CollectCCD(void)
{
    uint8_t index=0;

    CCD_CLK_HIGH;
    CCD_delay();
    CCD_SI_LOW;
    CCD_delay();

    CCD_SI_HIGH;
    CCD_delay();
    CCD_CLK_LOW;
    CCD_delay();

    CCD_CLK_HIGH;
    CCD_delay();
    CCD_SI_LOW;
    CCD_delay();

