tongkong1/MCU-CDK66/MK66F18_Ref9b.c
/*
// open-loop speed control
void MotorCtrlOL(uint8_t SpeedCmd)
{
	if(SpeedCmd>100)	//速度限制
		return;

	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);
}

// Closed-loop speed control
// feedback available on MotorSpeedFdbk1
void MotorCtrlCL(void)
{
	uint16_t CtrlValue=0;

	CtrlValue = MotorSpeedCal/10;		// MotorSpeedCal updated in PIT IRQ at an interval of 5ms
	if (CtrlValue > 60)					//限制CtrlValue,即限制最大速度
		CtrlValue = 60;

	//FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, CtrlValue);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);

}
*/

// Your code here to find the target tracking point
// Result: update TrackIndex value
// uint8_t TrackFlag=0;	// 0: Invalid track detection
//						// 1: Valid/Normal track found
//						// 2: Start/End Mark detected
//						// 3: Cross-road detected
//						// 4: Undefined
void FindTrackPoint(void)
{
	int16_t DMax, DMin, DV;		//记录像素灰度值从左边到右边的落差
	uint8_t MaxIndex, MinIndex, MinPointIndex;
	uint16_t MinPoint = 4096;
	uint16_t i;

	//寻找最大落差DMax和最低灰度值DMin
	DMax = 0;
	DMin = 0;
	//【For Debug Sake】 全局计数器清零
	BlackCounter = 0;
	EdgeCounter = 0;

	//【For Debug Sake】现在暂且设置为全局变量
	//uint8_t BlackCounter = 0;		//黑点计数器，主要用于判别十字路
	//uint8_t EdgeCounter = 0;		//边沿计数器，主要用于判别断续线

	for (i=0; i<126; i++)		//【TODO:这里是取用0~125是否会有影响】
	{
		//跳变沿检测
		DV = CCDData[i+2] - CCDData[i];		//DV为像素灰度值从左边到右边的落差【!!注意!! 中间滤去一个像素点】
		if (DV > DMax)		// Raising edge：灰度值从左向右爬升
		{
			DMax = DV;
			MaxIndex = i+1;
		}
		if (DV < DMin)		// Falling edge：灰度值从左向右下落
		{
			DMin = DV;
			MinIndex = i+1;
		}

		//最小值
		if( i > 3 && i < 124 )		//滤除边界点影响，对过弯中线处于边界可能有些影响
		{
			if( CCDData[i] <= MinPoint )
			{
				MinPoint = CCDData[i];
				MinPointIndex = i;
			}
		}

		//黑点计数
		if( CCDData[i] < 300 )
		{
			BlackCounter++;
		}

		//跳变沿计数
		if( abs(DV) > 100 )   //阈值可以适当调大
		{
			EdgeCounter++;
		}
	}

	// 特殊元素处理
	if( EdgeCounter >= 7 && BlackCounter > 22 )		//如果跳变沿超过某个阈值，识别为断续线
	{
		TrackIndex = 64;
		TrackFlag = 2;
		return;
	}

	if( BlackCounter > 50 )		//如果黑点个数超过阈值，识别为十字路
	{
		TrackIndex = 64;
		TrackFlag = 3;
		return;
	}

	// 中线识别前预处理,阳光滤波
	for (i=0; i<128; i++)
	{

		if( CCDData[i] > MinPoint + 200 )
		{
			CCDData[i] = MinPoint + 200;
		}

		/*
		if( CCDData[i] > MinPoint + 250 )
		{
			CCDData[i] = MinPoint + 250;
		}
		*/
	}

	// 中线识别
	DMax = DMin = 0;	// 重新初始化
	for (i=0; i<126; i++)
	{
		//跳变沿检测
		DV = CCDData[i+2] - CCDData[i];		//DV为像素灰度值从左边到右边的落差【!!注意!! 中间滤去一个像素点】
		if (DV > DMax)		// Raising edge：灰度值从左向右爬升
		{
			DMax = DV;
			MaxIndex = i+1;
		}
		if (DV < DMin)		// Falling edge：灰度值从左向右下落
		{
			DMin = DV;
			MinIndex = i+1;
		}
	}
	// Normal v.s. Invalid
		//if ((MaxIndex<MinIndex) || (DMax<120) || (DMin>(-120)))
	if( MaxIndex<MinIndex )
	{
		TrackFlag = 0;
		TrackErrorCounter++;
		return;
	}
	if ((DMax<70) && (DMin>(-70)))	// Invalid cases 限制上下跳变位置与跳变量【!!注意!! 120为自己定义的参数】
	{
		TrackFlag = 0;
		TrackErrorCounter++;		//错误数计数器，用于丢线保护装置
	}
	else
	{
		/*if ((MaxIndex-MinIndex) > 30)	// One of invalid cases		//限制山谷宽度【不知道适用于什么情况？】
		{
			TrackFlag = 0;
			TrackErrorCounter++;
		}
		else*/

		TrackFlag = 1;		// Normal track found
		if( DMax >= 70 && DMin <= -70)   //正常
		{
			TrackIndex = (MaxIndex+MinIndex)/2;
		}

		if(DMax >= 70 && DMin > -70)
		{
			TrackIndex = 0;
		}

		if(DMax <= 70 && DMin <= -70)
		{
			TrackIndex = 127;
		}

		TrackErrorCounter = 0;		//清除错误数计数器
	}
}

// indicate TrackIndex on OLED
void Draw_Mark(TrackIndex)
{
	uint8_t i=0;
	for (i=4; i<8; i++)
	{
		OLED_Set_Pos(TrackIndex, i);
		OLED_WrDat(0xFF);
	}
}

// 判别前方是否为弯道
bool isCurve(void)
{
	// 当中线出现在偏左或偏右位置时，说明可能有弯道出现，记录TrackOffsetCounter计数器；否则，说明进入直道，直接清零计数
	if( TrackIndex > 85 || TrackIndex < 40 )	//或许需要再测试下
	// if( TrackIndex > 80 || TrackIndex < 45 )
	{
		TrackOffsetCounter++;
	}
	else TrackOffsetCounter = 0;

	// 对TrackOffsetCounter设定阈值来确定直道/弯道
	if( TrackOffsetCounter > 5 )	return true;
	else 	return false;
}

/*
 * @brief   Application entry point.
 */
int main(void) {
 	uint8_t TaskID = 0;		// loop switch
    uint32_t LastSecond=0;
    //uint16_t ServoDutyCounter=0;
    //bool ServoDutyCountDir=1;		// 0: count down; 1: count up
	uint32_t tempInt = 0;
	uint16_t CCDMin = 0;
	uint8_t index = 0;
	bool BeepFlag = 0;	//【For Debug Sake】
	uint16_t LastQESVar = 0;
	bool StartRace = false;
	bool PastCrossroad = false;
	bool PastBeginLine = false;
	bool servoInitialed = false;
	uint8_t BeepCounter = 0;		// 十字线蜂鸣计数

	uint8_t CCD2PC[260];	// data to be sent to PC

	char OLEDLine1[] = "0123456789abcdef";
	char OLEDLine2[] = "0123456789abcdef";
	char OLEDLine3[] = "0123456789abcdef";
	char OLEDLine4[] = "0123456789abcdef";

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();

    BOARD_InitI2C();
    OLED_Init();

    KC4D();		// Welcome message
    // Header of CCD data frame, seekfree protocol
    CCD2PC[0] = 0x00;
	CCD2PC[1] = 0xFF;
	CCD2PC[2] = 0x01;
	CCD2PC[3] = 0x00;


#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif

	TaskID = (~((SW1()<<3) + (SW2()<<2) + (SW3()<<1) + SW4())) & 0x0F;
    PRINTF("Task ID: %d\r\n", TaskID);

    LastSecond = ElapsedSeconds;
    LED1_ON();    LED2_OFF();

    volatile static int i = 0 ;
    //ServoDutyCountDir = 1;	// count up
    //ServoDutyCounter = 500;	// Lower Limit

	if (TaskID == 1U)		// Test RC/Servo
	{
		QESVar = ServoDC1ref;
		ServoDC1 = ServoDC1ref;
		ServoDC2 = ServoDC2ref;
	}
    if (TaskID == 7U)		// using MT9V034?
		MT9V034_Init(50);
	if ((TaskID == 4U) || (TaskID == 9U))		// Test Motor driver?
	{
		M1_DISABLE();
		M2_DISABLE();
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_2, kFTM_EdgeAlignedPwm, 0);
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_4, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_7, kFTM_EdgeAlignedPwm, 0);
		M1_ENABLE();
	}

    OLED_Init();

    while(1) {
    	switch (TaskID)
    	{
    	case 1U:		// Tune ServoDC1 to find ServoLimitUpper and ServoLimitLower
						// 【TODO:电机控制闭环后】
        	//delay_short();
    		if (BTN())
    		{
    			//QESVar = ServoDC1ref;
				ServoDC1 = ServoDC1ref;
				ServoDC2 = ServoDC1ref;
    		}
    		if (KEY1())
    		{
    			if (ServoDC1 > 530)
    				ServoDC1 -= 5;
    			while (KEY1()) {}
    		}
    		if (KEY2())
    		{
    			if (ServoDC1 <= 2510)
    				ServoDC1 += 5;
    			while (KEY2()) {}
    		}
    		if (tempInt != ServoDC1)
    		{
    			tempInt = ServoDC1;
    			Update_ServoUS(kFTM_Chnl_0, tempInt);
    			Update_ServoUS(kFTM_Chnl_1, tempInt);
                sprintf (OLEDLine2, "PWM: %04hd", tempInt);
				OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
				ShowNumDEC( abs(tempInt-ServoDC1ref) );
    		}
    		break;
    	case 2U:		// MEMS data acquisition and processing
            CDK66_Analog_Input(&AnalogIn);		// Update all analog inputs
            MemsX = AnalogIn.x;
            MemsY = AnalogIn.y;
            MemsZ = AnalogIn.z;
            //MemsX1 = ((float)MemsX-2048.0)/101.3234;
            //MemsY1 = ((float)MemsY-2048.0)/101.3234;
            //MemsZ1 = ((float)MemsZ-2048.0)/101.3234;
    		break;
    	case 3U:		// MEMS data acquisition and processing
            CDK66_Analog_Input(&AnalogIn);		// Update all analog inputs
            if (KEY1())
            {
                sprintf (OLEDLine2, "x:%04hd  IR1:%04hd", AnalogIn.x, AnalogIn.IRV1);
                sprintf (OLEDLine3, "y:%04hd  IR2:%04hd", AnalogIn.y, AnalogIn.IRV2);
            }
            else
            {
                sprintf (OLEDLine2, "x:%04hd  Mg1:%04hd", AnalogIn.x, AnalogIn.HALL1);
                sprintf (OLEDLine3, "y:%04hd  Mg2:%04hd", AnalogIn.y, AnalogIn.HALL2);
            }
            sprintf (OLEDLine4, "z:%04hd  ct:%04hd", AnalogIn.z, AnalogIn.Temp);
            //sprintf (OLEDLine4, "z:%04hd  ct:%4.1fC", AnalogIn.z, ICTemp);
            OLED_P8x16Str(0,0,(uint8_t *)"## Cyber-K66 ###");
    	    OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
    	    OLED_P8x16Str(0,4,(uint8_t *)OLEDLine3);
    	    OLED_P8x16Str(0,6,(uint8_t *)OLEDLine4);
    		break;
    	case 4U:		// TSL1401 Linear CCD acquisition and display
        	//CollectCCD();
        	LinearCameraOneShot();
        	// draw linear CCD 128 pixel on OLED
    		//Draw_LinearView();
    		Draw_LinearViewHalf();
			FindTrackPoint();

    		if (KEY1())		// 把预处理前/后的像素灰度值传给上位机【很漂亮的设计，只有按下按键时才会进行上位机通讯，不会影响实际调试时程序运行效率】
    		{
    	    	//send 128 points CCD data (128*2byte) to UART0, using seekfree protocol
    			for(tempInt=0; tempInt<128; tempInt++)
    			{
    				CCD2PC[tempInt*2+4] = CCDData[tempInt] >> 8;	// Upper byte
    				CCD2PC[tempInt*2+5] = CCDData[tempInt] & 0XFF;	// Lower byte
    			}
    			UART_WriteBlocking(UART0_PERIPHERAL, CCD2PC, 260U);
    		}
    		// FindTrackPoint();		// your code to find the tracking point
    		Draw_Mark(TrackIndex);	// indicate TrackIndex on OLED

    		// 特殊道路元素控制
    		// For Debug Sake:

    		switch( TrackFlag )
    		{
			case 2: 	// 断续线识别
				BEEP_ON();
				PastBeginLine = true;

