tongkong1/MCU-CDK66/MK66F18_Ref9b.c
				if( PIT_500ms_status == 1 )		// 100ms到了
				{
					LapCounter++;				// 记录已经跑了一圈
					PIT_500ms_counter = 0;		// 重置计时，作为元素保护
				}
				break;

			case 3: 	// 十字路识别
				BEEP_ON();
				PastCrossroad = true;
				break;

			default:
				if( PastBeginLine )	// 断续线蜂鸣器操作
				{
					if( PIT_20ms_status )	// 20ms到了
					{
						if( ++BEEP_inteval_counter >= 10 )
						{
							BEEP_inteval_counter = 0;
							BEEP_OFF();
							PastBeginLine = false;
						}
					}
				}
				if( PastCrossroad )	// 十字线蜂鸣器操作
				{
					if( PIT_20ms_status )	// 20ms到了
					{
						if( ++BEEP_inteval_counter >= 5 )
						{
							BEEP_inteval_counter = 0;
							switch( BeepCounter )
							{
								case 0:
									BEEP_OFF();
									break;
								case 1:
									BEEP_ON();
									break;
								case 2:
									PastCrossroad = false;
									BEEP_OFF();
									break;
								default: 	break;
							}

							BeepCounter = (BeepCounter+1) % 3;
						}
					}
				}
				break;
    		}

 			//预瞄点位置与舵机pwm占空比换算，更新舵机角度
			/*
			if(TrackIndex >= 45 && TrackIndex <= 82)
			{
				tempInt = 1183.5 + TrackIndex*5.141;
			}
			else if(TrackIndex < 45)
			{
				tempInt = 186.4 + TrackIndex*27.299;      //TrackIndex为32时达到极限
			}
			else
			{
				tempInt = -633.4 + TrackIndex*27.299;   //TrackIndex为95时达到极限
			}
			if(tempInt <= ServoLimitLower)   //舵机超限位保护
			{
				tempInt = ServoLimitLower;
			}
			if(tempInt >= ServoLimitUpper)
			{
				tempInt = ServoLimitUpper;
			}   //5.22版本,63.5为中心
			*/

			// PID策略
			servo_PIDInfo->input = 63.5-TrackIndex;
			tempInt = ServoDC1ref + (int32_t)PIDCalc( 0, servo_PIDInfo );
    		Update_ServoUS(kFTM_Chnl_0, (int)(tempInt));
			Update_ServoUS(kFTM_Chnl_1, (int)(tempInt));

			// 策略2：匀速

			if (BTN())
			{
			    MotorSpeedTarget = MotorSpeedRef;
				if( !servoInitialed )
				{
					servo_PIDInfo->error = 0;
					servo_PIDInfo->integral = 0;
					servo_PIDInfo->derivative = 0;
					servoInitialed = true;
				}
			}
			if (KEY1())
	        {
			    if (MotorSpeedRef >= 110)
			        MotorSpeedRef -= 10;
			    while (KEY1()) {}
			}
			if (KEY2())
			{
			    if (MotorSpeedRef <= 500)
			        MotorSpeedRef += 10;
			    while (KEY2()) {}
			}

			if( LapCounter >= 3 )
			{
				MotorSpeedTarget = 0;
				if( MotorSpeedTarget == 0)
				{
					delay();
					BEEP_OFF();
				}
			}

			// 策略1：直道加速，弯道减速
			/*
			if( BTN() )
			{
				StartRace = true;
			}
			if( StartRace )
			{
				if(LapCounter < 3)
				{
					// 根据前方道路是直道还是弯道来调节运行速度
					if( isCurve() )			//如果是弯道，则迅速减速/慢慢减速？
					{
						//BEEP_ON();
						// MotorSpeedTarget = 140;//-= 10
						// if( MotorSpeedTarget >= 150 )	MotorSpeedTarget -= 10;
						// else	MotorSpeedTarget = 140;

						if( MotorSpeedTarget >= 110 )	MotorSpeedTarget -= 10;
						else	MotorSpeedTarget = 100;
						if( MotorSpeedTarget >= 100 )	MotorSpeedTarget -= 30;
						else	MotorSpeedTarget = 70;

						// 下面这段代码是弯道分段
						if( EnterCurveSpeed > 300 )		// 高速入弯
						{
							if( MotorSpeedTarget >= 110 )	MotorSpeedTarget -= 20;
							else	MotorSpeedTarget = 100;
						}
						else	// 低速入弯
						{
							BEEP_ON();		//【For Debug Sake】
							if( MotorSpeedTarget >= 180 )	MotorSpeedTarget -= 10;
							else	MotorSpeedTarget =170;
						}
						// 上面这段代码是弯道分段

					}
					else					//如果是直道，则迅速加速/慢慢加速？
					{
						//BEEP_OFF();
						//MotorSpeedTarget = 300;//-= 10

						// if( MotorSpeedTarget <= 290 )	MotorSpeedTarget += 10;
						// else	MotorSpeedTarget = 300;
						if( MotorSpeedTarget <= 220 )	MotorSpeedTarget += 45;
						else if( MotorSpeedTarget <= 360 ) MotorSpeedTarget += 25;
						else MotorSpeedTarget = 370;
						EnterCurveSpeed = MotorSpeedFdbk1;
					}

				}
				else
				{
					if( MotorSpeedTarget > 100)  MotorSpeedTarget -= 100;
					else 	MotorSpeedTarget = 0;

					if( MotorSpeedTarget == 0)
					{
						delay();
						BEEP_OFF();
					}
				}
			}
			*/

			//显示屏显示项目，便于调试
			sprintf (OLEDLine1, "Tar: %03hd,Ref:%03hd", MotorSpeedTarget, MotorSpeedRef);
            sprintf (OLEDLine2, "Target: %03hd  %01hd", TrackIndex, TrackFlag);
			OLED_P8x16Str(0,0,(uint8_t *)OLEDLine1);
			OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);

			//如果错误场景出现多次，判定为丢线，进行丢线保护

			if (TrackErrorCounter >= 40)		// adjust the counter limit to meet your expectation
			{
				while(1)
				{
					MotorSpeedTarget = 0;		// 强制停车
					Update_ServoUS(kFTM_Chnl_0, ServoDC1ref);

					BEEP_ON();
					delay_short();
					BEEP_OFF();
					delay_short();
					BEEP_ON();
					delay_short();
					BEEP_OFF();
				}
			}


    		LED1_TOGGLE();
            break;
    	case 7U:		// MT9V034 image capture and display
        	if (CamDataReady)
        	{
        		Get_Use_Image();		// resize data to fit OLED
        		if (KEY1())				// key S1 pressed down? If yes then use OTSU
        			Get_01_Value(1);	// 1 - OTSU; 0 - average
        		else
        			Get_01_Value(0);	// 1 - OTSU; 0 - average
        		Draw_CameraView();		// display on OLED
        		if (KEY2()) SendImage();	// key S2 pressed down? If yes send ImageData to PC
        		CamDataReady = 0;
        	}
    		break;
    	case 8U:		// RTC: "#cmd01data20230405-180000\r\n"
        	if (ElapsedSeconds != LastSecond)	// ElapsedSeconds increased in RTC_Seconds_IRQn
        	{
        		LED1_TOGGLE();	LED2_TOGGLE();
        		LastSecond = ElapsedSeconds;
        		RTC_GetDatetime(RTC, &appDateTime);
    			sprintf (OLEDLine1, "Date: %04hd-%02hd-%02hd", appDateTime.year, appDateTime.month, appDateTime.day);
    			sprintf (OLEDLine2, "Time: %02hd:%02hd:%02hd", appDateTime.hour, appDateTime.minute, appDateTime.second);
    			OLED_P8x16Str(0,0,(uint8_t *)OLEDLine1);
    			OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
        	}
    		break;
    	case 9U:		// Test motor drive //【TODO:增加一个pid控制菜单】
    		if (BTN())
    		{
    			MotorSpeedTarget = 300;
				Button_Cnt = (Button_Cnt + 1) % 4;		//【这里修复过了一个bug】
				while (BTN()) {}
    		}
    		if (KEY1())
    		{
    			if (MotorSpeedTarget >= 10)
    				MotorSpeedTarget -= 10;
    			while (KEY1()) {}
    		}
    		if (KEY2())
    		{
    			if (MotorSpeedTarget <= 600)
    				MotorSpeedTarget += 10;
    			while (KEY2()) {}
    		}

    		//PID参数调节面板
    		switch( Button_Cnt )
			{
				case 0:		//不调节参数
					sprintf (OLEDLine4, "Now for nothing");
					break;
				case 1:		//调节Kp
					sprintf (OLEDLine4, "Now for Kp     ");
					break;
				case 2:		//调节Ki
					sprintf (OLEDLine4, "Now for Ki     ");
					break;
				case 3:		//调节Kd
					sprintf (OLEDLine4, "Now for Kd     ");
					break;
				default:
					break;
			}

			//PID参数调节
			if( QESVar != LastQESVar )		//编码器旋转了
			{
				switch( Button_Cnt )
				{
					case 0:		//不调节参数
						//sprintf (OLEDLine4, "Now for nothing");
						break;
					case 1:		//调节Kp
						//sprintf (OLEDLine4, "Now for Kp     ");
						if( QESVar>LastQESVar )		motor_PIDInfo->kp += 0.05;
						else 			motor_PIDInfo->kp -= 0.05;
						break;
					case 2:		//调节Ki
						//sprintf (OLEDLine4, "Now for Ki     ");
						if( QESVar>LastQESVar )		motor_PIDInfo->ki += 0.05;
						else 			motor_PIDInfo->ki -= 0.05;
						break;
					case 3:		//调节Kd
						//sprintf (OLEDLine4, "Now for Kd     ");
						if( QESVar>LastQESVar )		motor_PIDInfo->kd += 0.05;
						else 			motor_PIDInfo->kd -= 0.05;
						break;
					default:
						break;
				}
				LastQESVar = QESVar;
			}

			// OLED菜单显示
    		if (ElapsedSeconds != LastSecond)	// ElapsedSeconds increased in RTC_Seconds_IRQn
    		{
    			LastSecond = ElapsedSeconds;
				sprintf(OLEDLine1, "Target: %03hd", MotorSpeedTarget);
				//sprintf(OLEDLine2, "Feedback: %03hd", MotorSpeedFdbk1);
				sprintf(OLEDLine2, "p: %.2f, i:%.2f", motor_PIDInfo->kp, motor_PIDInfo->ki);
				sprintf(OLEDLine3, "d:%.2f", motor_PIDInfo->kd);
				OLED_P8x16Str(0,0,(uint8_t *)OLEDLine1);
				OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
				OLED_P8x16Str(0,4,(uint8_t *)OLEDLine3);
				OLED_P8x16Str(0,6,(uint8_t *)OLEDLine4);
    		}

    		break;
    	case 14U:
    		if (KEY1())
    	    {
    	        if (Exposure_Time >= 1)
    	        {
    	        	Exposure_Time += 1;
    	        }
    			while (KEY1()) {}
    	    }
    		if (KEY2())
    		{
    		    if (Exposure_Time > 1)
    		    {
    		    	Exposure_Time -= 1;
    		    }
    		    while (KEY2()) {}
    		}
    		//CollectCCD();
			LinearCameraOneShot();
			// draw linear CCD 128 pixel on OLED
			//Draw_LinearView();
			Draw_LinearViewHalf();
			FindTrackPoint();

			if (BTN())		// 把预处理前/后的像素灰度值传给上位机【很漂亮的设计，只有按下按键时才会进行上位机通讯，不会影响实际调试时程序运行效率】
			{
				//send 128 points CCD data (128*2byte) to UART0, using seekfree protocol
				for(tempInt=0; tempInt<128; tempInt++)
				{
					CCD2PC[tempInt*2+4] = CCDData[tempInt] >> 8;	// Upper byte
					CCD2PC[tempInt*2+5] = CCDData[tempInt] & 0XFF;	// Lower byte
				}
				UART_WriteBlocking(UART0_PERIPHERAL, CCD2PC, 260U);
			}
			//FindTrackPoint();		// your code to find the tracking point
			Draw_Mark(TrackIndex);	// indicate TrackIndex on OLED

			sprintf(OLEDLine2, "ET: %03hd", Exposure_Time);
    	    OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);

    	case 15U:
			if( Second_Cnt == 1 && !BeepFlag )	//没响过
			{
				BEEP_ON();
				Second_Cnt = 0;	//开始计时
				BeepFlag = 1;
			}
			if( Second_Cnt == 1 && BeepFlag )	//响过且过了2s（大约）
			{
				BEEP_OFF();
			}

			break;

    	default:		// HMI basics
    		i++;
    		delay();
            if (KEY1()) LED1_ON();
            else LED1_OFF();
            if (KEY2()) LED2_ON();
            else LED2_OFF();
    		if (BTN()) BEEP_ON();
            else BEEP_OFF();
	        ShowNumDEC(i);
	        BOARD_I2C_GPIO(i);
    		break;
    	}
    }
    return 0 ;
}
